import React, { Component } from 'react';
import Header from './Header'
import Footer from './Footer'
import { css, StyleSheet } from 'aphrodite'
import './styles/text.css'

import { connect } from 'react-redux'
import { withRouter } from 'react-router'

class About extends Component {

    render() {
        return (
            <div>
                <Header/>
                <div className="text">
                    <div className="textContainer">
                        <p>Компанія «КліматКомплект» пропонує професійне вентиляційне обладнання від провідних європейських брендів. Ми успішно працюємо в цій галузі з 2004 року, тож встигли зарекомендувати себе, як експерта та надійного партнера.</p>
                        <p>Ми пропонуємо такі послуги:</p>
                        <ul>
                            <li>-	Прямі поставки обладнання від європейського виробника;</li>
                            <li>-	Гарантійне та післягарантійне обслуговування обладнання;</li>
                            <li>-	Консультації щодо всього комплексу питань вентиляційних систем;</li>
                            <li>-	Шеф-монтажні та пусконалагоджувальні роботи;</li>
                            <li>-	Проектування та виробництво силових щитів, систем контролю та автоматизації обладнання;</li>
                            <li>-	Виконання комплексу робіт, щодо систем центральної диспетчеризації вентиляційних систем.</li>
                        </ul>
                        <p>Наша мета – допомогти Вам при виборі вентиляційної системи, та зробити її сучасною, доступною, надійною та енергоощадливою. Ми обов’язково враховуємо усі особливості Вашої галузі, щоб обрати найоптимальніше рішення для створення необхідних умов.</p>
                        <p>По всій території України Ви можете зустріти будівлі, що обладнані нашою продукцією. </p>
                        <p>Ці об’єкти – предмет гордості та найкраще свідчення якості нашої роботи. Це великі бізнес-центри, лікарні, торгові центри та інші спорудження зі складною системою вентиляцій, адже в них існує обширна кількість зон, що потребують абсолютно різних конструкцій.</p>
                        <p>Ми вміємо створювати мікроклімат на таких специфічних підприємствах, як фармацевтичні, лікероводочні, табачні, підприємства точного машинобудування і т. д. Також ми організуємо необхідні комфортні умови у громадських місцях, таких як клуби, кафе, ресторани, лікарні, басейни, спортивні комплекси та інше.</p>
                        <p>На нашому сайті ви можете ознайомитися з результатами роботи компанії, що представлені у розділі «Об’єкти».</p>
                        <p>На складі нашої компанії завжди є наявний запас стандартного вентиляційного обладнання усіх типів. Вся техніка має європейські сертифікати якості та українські сертифікати відповідності. Для зручності замовника обладнання забезпечується необхідною технічною документацією, паспортами та інструкцією з монтажу та експлуатації. </p>
                        <p>Розвиток компанії «КліматКомплект» - це відкриття нових перспектив для наших клієнтів, партнерів та співробітників. Ми прагнемо вдосконалювати отримані знання, відкривати нові напрямки роботи, розширяти професійний склад команди та впроваджувати останні світові розробки у сфері вентиляційного обладнання у професійне надбання партнерів та повсякденність пересічних українців.</p>
                    </div>
                </div>
                <Footer/>
            </div>
        )
    }}

export default connect(state => ({state:state}))(withRouter(About))