import React, { Component } from 'react';
import Header from './Header'
import Footer from './Footer'
import { css, StyleSheet } from 'aphrodite'
import './styles/text.css'

import { connect } from 'react-redux'
import { withRouter } from 'react-router'

class Reference extends Component {

    render() {
        return (
            <div>
                <Header/>
                <div className="text">
                    <div className="textContainer">
                        <p>За 15 років існування, ми сформували та вишколили професійний сервісний відділ, який досконало знає усі особливості та переваги нашого обладнання, тонкощі його інсталювання та експлуатації. Наші працівники регулярно проходять курси підвищення кваліфікації на заводах-виробниках в Європі, щоб завжди бути на хвилі актуальних трендів у своїй професійній сфері.</p>
                        <p>Ви можете бути впевнені, що буде знайдено варіант рішення для системи будь-якої складності та полагоджено кожен пошкоджений у процесі експлуатації елемент, якщо виникне така необхідність. </p>
                        <p>Наш сервісний відділ вповноважений проводити гарантійне та пост-гарантійне обслуговування об’єктів.Якість наших сервісних послуг – постійний вектор нашого розвитку. Прибрати дефекти, налаштувати складний пристрій, підібрати параметри для специфічних умов? Наш сервісний відділ завжди знайде рішення задачі максимально комфортним за найменш затратним можливим шляхом.</p>
                        <p>Не зволікайте та звертайтеся до нашого сервісного відділу при будь-яких ознаках несправності або якщо виникають питання стосовно особливостей експлуатації обладнання.</p>
                    </div>
                </div>
                <Footer/>
            </div>
        )
    }}

export default connect(state => ({state:state}))(withRouter(Reference))